content/posts/collectors_fallacy.md
+++
title = "collectors fallacy"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:36:40-04:00
slug = "collectors_fallacy"
draft = false
+++

## \_\_There’s a tendency in all of us to gather useful stuff and feel good about it. To collect is a reward in itself. As knowledge workers, we’re inclined to look for the next groundbreaking thought, for intellectual stimulation: we pile up promising books and articles, and we store half the internet as bookmarks, just so we get the feeling of being on the cutting edge. Let’s call this “The Collector’s Fallacy”. Why fallacy? Because ‘to know about something’ isn’t the same as ‘knowing something’. Just knowing about a thing is less than superficial since knowing about is merely to be certain of its existence, nothing more.\_\_ — via [The Collector’s Fallacy • Zettelkasten Method](<https://zettelkasten.de/posts/collectors-fallacy/>) {#there-s-a-tendency-in-all-of-us-to-gather-useful-stuff-and-feel-good-about-it-dot-to-collect-is-a-reward-in-itself-dot-as-knowledge-workers-we-re-inclined-to-look-for-the-next-groundbreaking-thought-for-intellectual-stimulation-we-pile-up-promising-books-and-articles-and-we-store-half-the-internet-as-bookmarks-just-so-we-get-the-feeling-of-being-on-the-cutting-edge-dot-let-s-call-this-the-collector-s-fallacy-dot-why-fallacy-because-to-know-about-something-isn-t-the-same-as-knowing-something-dot-just-knowing-about-a-thing-is-less-than-superficial-since-knowing-about-is-merely-to-be-certain-of-its-existence-nothing-more-dot-via-the-collector-s-fallacy-zettelkasten-method--https-zettelkasten-dot-de-posts-collectors-fallacy}


## \_\_In this video, we talk about the collector's fallacy. This describes how we store up books, articles, podcasts, and other forms of knowledge or information and never actually do anything with it. We collect it, then it sits.\_\_ — via [What You're Doing Wrong With the Information You Read \* YouTube](<https://www.youtube.com/watch?v=ZCy0ZfqL09g>) {#in-this-video-we-talk-about-the-collector-s-fallacy-dot-this-describes-how-we-store-up-books-articles-podcasts-and-other-forms-of-knowledge-or-information-and-never-actually-do-anything-with-it-dot-we-collect-it-then-it-sits-dot-via-what-you-re-doing-wrong-with-the-information-you-read-youtube--https-www-dot-youtube-dot-com-watch-v-zcy0zfql09g}


##  {#}
